# GetAllIntersectionElements Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..GetAllIntersectionElements Method
DividedSurface Class See Also
---
Gets all intersection elements which produce division lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetAllIntersectionElements()
```

Visual Basic
---
```text
Public Function GetAllIntersectionElements As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetAllIntersectionElements()
```

# ### Return Value
The intersection elements.
# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace